app/Controllers/AuthController.php

    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new UserModel();
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `User`
WHERE `email` = 'admin@regime.com'
 LIMIT 1