app/Controllers/UserController.php

INSERT INTO `User` (`nom`, `email`, `password`, `genre`, `taille`, `poids`, `IMC`, `role`, `balance`) VALUES ('final', 'f@i.t', 'qwerty', 'homme', 175, 60, 19.59, 'user', 0)
---
        $userModel = new UserModel();
        $userModel->skipValidation(true);

        $insertedId = $userModel->insert([
            'nom' => $signupData['nom'],
            'email' => $signupData['email'],
            'password' => $signupData['password'],
            'genre' => $signupData['genre'],
            'taille' => $tailleCm,
            'poids' => $poids,
            'IMC' => $imc,
            'role' => 'user',
            'balance' => 0
        ], true);