app/Models/CodeModel.php

    public function findValidCode(string $code): ?array
    {
        $code = strtoupper(trim($code));

        if ($code === '') {
            return null;
        }

        return $this
            ->where('code', $code)
            ->where('utilise', 0)
            ->groupStart()
                ->where('expire_le >=', date('Y-m-d'))
                ->orWhere('expire_le', null)
            ->groupEnd()
            ->first();
---
SELECT *
FROM `Code`
WHERE `code` = 'BIENVENUE10'
AND `utilise` = 0
AND   (
`expire_le` >= '2026-05-09'
OR `expire_le` IS NULL
 )
 LIMIT 1

    public function markAsUsed(int $codeId): bool
    {
        return (bool) $this->update($codeId, ['utilise' => 1]);
---
UPDATE `Code` SET `utilise` = 1
WHERE `Code`.`id` IN (1)

    public function redeemForUser(string $codeInput, int $userId): array
    {
        $userModel = new UserModel();
        $user = $userModel->findUserById($userId);

        if (!$user) {
            return ['success' => false, 'message' => 'Utilisateur introuvable.'];
        }

        $code = $this->findValidCode($codeInput);

        if (!$code) {
            return ['success' => false, 'message' => 'Code invalide ou deja utilise.'];
        }

        $db = $this->db;
        $db->transStart();

        $currentBalance = is_numeric($user['balance']) ? (float) $user['balance'] : 0.0;
        $newBalance = $currentBalance + (float) $code['valeur'];

        $userModel->update($userId, ['balance' => $newBalance]);
---
UPDATE `User` SET `balance` = 60
WHERE `User`.`id` IN (2)