app/Models/RegimeModel.php

SELECT *
FROM `Regime`
WHERE `variation_poids_grammes` < 0
ORDER BY `variation_poids_grammes` ASC
---
    public function getRegimesPertePoids(): array
    {
        return $this
            ->where('variation_poids_grammes <', 0)
            ->orderBy('variation_poids_grammes', 'ASC')
            ->findAll();

SELECT *
FROM `Regime`
WHERE `variation_poids_grammes` > 0
ORDER BY `variation_poids_grammes` DESC
---
    public function getRegimesGainPoids(): array
    {
        return $this
            ->where('variation_poids_grammes >', 0)
            ->orderBy('variation_poids_grammes', 'DESC')
            ->findAll();