app/Models/SportModel.php

    public function getSportsPertePoids(): array
    {
        return $this
            ->where('variation_poids_grammes <', 0)
            ->orderBy('variation_poids_grammes', 'ASC')
            ->findAll();
---
SELECT *
FROM `Sport`
WHERE `variation_poids_grammes` < 0
ORDER BY `variation_poids_grammes` ASC

    public function getSportsGainPoids(): array
    {
        return $this
            ->where('variation_poids_grammes >', 0)
            ->orderBy('variation_poids_grammes', 'DESC')
            ->findAll();
---
SELECT *
FROM `Sport`
WHERE `variation_poids_grammes` > 0
ORDER BY `variation_poids_grammes` DESC