app/Models/UserModel.php

SELECT *
FROM `User`
WHERE `User`.`id` = 2
---
    public function findUserById(int $id): ?array
    {
        $user = $this->find($id);